In [2]:
import pandas as pd
df=pd.read_csv('../data/student_performance.csv')
df.head()

   student_id  study_hours  attendance  exam_score  gender
0           1            2          65          45    Male
1           2            4          70          55  Female
2           3            6          80          65    Male
3           4            8          90          78  Female
4           5            1          50          40    Male